testCases/04_CFD-DEM/01_glitters_and_impeller/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0


runApplication blockMesh

application=`getApplication`

runApplication $application

paraFoam -touch
paraFoam -builtin -touch

# ----------------------------------------------------------------- end-of-file
